perf/heavy.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node-replicated:
      target: 'http://localhost:5555/node-replicated/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50

  phases:
    - name: Ramp_1
      duration: 7
      arrivalRate: 5 # requests per second
      rampTo: 10
    - name: Ramp_2
      duration: 7
      arrivalRate: 10 # requests per second
      rampTo: 15
    - name: Ramp_3
      duration: 7
      arrivalRate: 15 # requests per second
      rampTo: 20
    - name: Ramp_4
      duration: 7
      arrivalRate: 20 # requests per second
      rampTo: 25
    - name: Ramp_5
      duration: 7
      arrivalRate: 25 # requests per second
      rampTo: 30
    - name: Ramp_6
      duration: 7
      arrivalRate: 30 # requests per second
      rampTo: 35
    - name: Ramp_7
      duration: 7
      arrivalRate: 35 # requests per second
      rampTo: 40
    - name: Ramp_8
      duration: 7
      arrivalRate: 40 # requests per second
      rampTo: 45
    - name: Ramp_9
      duration: 7
      arrivalRate: 45 # requests per second
      rampTo: 50
    - name: Ramp_10
      duration: 7
      arrivalRate: 50 # requests per second
      rampTo: 55
    - name: Ramp_11
      duration: 7
      arrivalRate: 55 # requests per second
      rampTo: 60
    - name: Ramp_12
      duration: 7
      arrivalRate: 60 # requests per second
      rampTo: 65
    - name: Ramp_13
      duration: 7
      arrivalRate: 65 # requests per second
      rampTo: 70
    - name: Ramp_14
      duration: 7
      arrivalRate: 70 # requests per second
      rampTo: 75
    - name: Ramp_15
      duration: 7
      arrivalRate: 75 # requests per second
      rampTo: 80
    - name: Ramp_16
      duration: 7
      arrivalRate: 80 # requests per second
      rampTo: 85
    - name: Ramp_17
      duration: 7
      arrivalRate: 85 # requests per second
      rampTo: 90

scenarios:
  - name: Heavy (/heavy)
    flow:
      - get:
          url: '/heavy?t=1'