perf/longer_timeout.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node-replicated:
      target: 'http://localhost:5555/node-replicated/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50

  phases:
    - name: Plain
      duration: 100
      arrivalRate: 5 # requests per second


scenarios:
  - name: Timeout (/timeout)
    flow:
      - get:
          url: '/timeout/100'